{
    "translation": {
        "Welcome to React": "Bem vindo ao React com react-i18next",
        "Full-stack web and mobile app developer, and amateur DJ.": "Desenvolvedor web e mobile Full-stack, e DJ amador.",
        "I am a Full-stack developer with expertise in Node.js, React, PHP, Python, C#, mobile development, and more. I have experience in building scalable, secure and reliable web applications using various frameworks and technologies. I enjoy solving complex problems and learning new skills. I am passionate about creating high-quality code that follows best practices and industry standards. I am always looking for new challenges and opportunities to grow as a developer.": "Sou um desenvolvedor Full-stack com especialização em Node.js, React, PHP, Python, C#, desenvolvimento móvel e mais. Tenho experiência na construção de aplicações web escaláveis, seguras e confiáveis usando vários frameworks e tecnologias. Gosto de resolver problemas complexos e aprender novas habilidades. Sou apaixonado por criar códigos de alta qualidade que seguem as melhores práticas e padrões da indústria. Estou sempre em busca de novos desafios e oportunidades para crescer como desenvolvedor.",
        "The Tik Tech is a video generator application that explains Node.js and Python frameworks and libraries. It automates the creation of explanatory videos on how to use different frameworks and libraries, generating sample code, narrating the steps, and combining everything into a video.": "O Tik Tech é um aplicativo gerador de vídeos que explica frameworks e bibliotecas de Node.js e Python utilizando Inteligência Artificial. Ele automatiza a criação de vídeos explicativos sobre como utilizar diferentes frameworks e bibliotecas, gerando código de exemplo, narrando os passos e juntando tudo em um vídeo.",
        "This is a simple coffee shop application built with Rust and the Axum web framework. The application allows users to create orders, view their orders, and manage coffee items.": "Esta é uma aplicação de cafeteria simples construída com Rust e o framework web Axum. A aplicação permite que os usuários criem pedidos, visualizem seus pedidos e gerenciem itens de café.",
        "It's a sleek front-end coffee sales application developed using React, Styled Components, and Axios for a seamless user experience. It features functionalities like order creation, viewing, and coffee item management, with a focus on responsive design and efficient data handling. The application is built with a robust stack, including TypeScript and Vite, ensuring high performance and maintainability.": "Um elegante aplicativo de vendas de café de front-end desenvolvido usando React, Styled Components e Axios para uma experiência de usuário perfeita. Ele possui funcionalidades como criação de pedidos, visualização e gerenciamento de itens de café, com foco em design responsivo e eficiente manipulação de dados. O aplicativo é construído com uma pilha robusta, incluindo TypeScript e Vite, garantindo alto desempenho e manutenibilidade.",
        "It was with the need to download images directly from Pexels and transfer them to the cell phone that the idea of creating Uaupaper came about. And that is what the application consists of, in searching for and downloading beautiful images directly to the smartphone gallery.": "Foi com a necessidade de baixar imagens diretamente do pexels e passar para o celular que surgiu a ideia de criar o Uaupaper. E é nisso que consiste o aplicativo, em buscar e baixar lindas imagens diretamente para a galeria do smartphone.",
        "This is a simple to-do list application built with React and TypeScript. The application allows users to create, view, and delete tasks. The taks are stored in the browser's local storage.": "Esta é uma aplicação de lista de tarefas simples construída com React e TypeScript. A aplicação permite que os usuários criem, visualizem e excluam tarefas. As tarefas são armazenadas no local storage do navegador.",
        "The Kronos Partners is an application that was developed with the goal of making inventory control, entries, exits, and promotions of the tobacco shop (Kronos Hookah) as simple as possible.": "O Kronos Partners é um aplicativo mobile que foi desenvolvido com o objetivo de tornar o controle de estoque, entrada, saídas e promoções da tabacaria(Kronos Hookah) o mais simples possível.",
        "This is a simple timer pomodoro application built with React and TypeScript. The application uses concepts of hooks, context API and reducers.": "Esta é uma aplicação de timer pomodoro simples construída com React e TypeScript. A aplicação utiliza conceitos de hooks, context API e reducers.",
        "Things I’ve made trying to put my dent in the universe.": "Coisas que eu fiz na tentativa de deixar minha marca no universo.",
        "I've worked on a variety of projects over the years and I'm proud of the progress I've made. Many of these projects are open-source and available for others to explore and contribute to. If you're interested in any of the projects I've worked on, please feel free to check out the code and suggest any improvements or enhancements you might have in mind. Collaborating with others is a great way to learn and grow, and I'm always open to new ideas and feedback.": "Trabalhei em uma variedade de projetos ao longo dos anos e estou orgulhoso do progresso que fiz. Há alguns projetos que são de código aberto e estão disponíveis para que outros possam explorar e contribuir. Se você estiver interessado em algum dos projetos em que trabalhei, sinta-se à vontade para verificar o código e sugerir quaisquer melhorias ou aprimoramentos que você possa ter em mente. Colaborar com outras pessoas é uma ótima maneira de aprender e crescer, e estou sempre aberto a novas ideias e feedbacks.",
        "View Video": "Ver Vídeo",
        "View Repository": "Ver Repositório",
        "View Project": "Ver Projeto",
        "Home": "Início",
        "About": "Sobre",
        "Projects": "Projetos",
        "Contact": "Contato",
        "Articles": "Artigos",
        "English": "Inglês",
        "Portuguese": "Português",
        "Work": "Experiências",
        "I’m Vinicius Gomes. I live in Sao Paulo - Brazil, where I design the future.": "Eu sou Vinicius Gomes. Eu moro em São Paulo - Brasil, onde eu desenho o futuro.",
        "All Rights Reserved.": "Todos os direitos reservados.",
        "Follow on": "Siga-me no",
        "I'm passionate about pushing the boundaries of what's possible and inspiring the next generation of innovators.": "Sou apaixonado por ultrapassar os limites do que é possível e inspirar a próxima geração de inovadores.",
        "Chronological collection of my long-form thoughts on programming, leadership, product design, and more.": "Coleção cronológica dos meus pensamentos sobre programação, liderança, design de produtos e muito mais.",
        "Let's Get in Touch: Ways to Connect with Me": "Vamos nos conectar: Formas de entrar em contato comigo",
        "Thank you for your interest in getting in touch with me. I welcome your feedback, questions, and suggestions. If you have a specific question or comment, please feel free to email me directly at": "Obrigado pelo seu interesse em entrar em contato comigo. Eu agradeço seu feedback, perguntas e sugestões. Se você tiver uma pergunta ou comentário específico, sinta-se à vontade para me enviar um e-mail diretamente para",
        "I make an effort to respond to all messages within 24 hours, although it may take me longer during busy periods. Alternatively, you can use the contact form on my website to get in touch. Simply fill out the required fields and I'll get back to you as soon as possible. Finally, if you prefer to connect on social media, you can find me on": "Eu me esforço para responder a todas as mensagens dentro de 24 horas, embora possa demorar mais durante os períodos de maior movimento. Alternativamente, você pode usar o formulário de contato no meu site para entrar em contato. Basta preencher os campos obrigatórios e entrarei em contato o mais breve possível. Por fim, se você preferir se conectar nas redes sociais, pode me encontrar no",
        "I post regular updates and engage with my followers there, so don't hesitate to reach out. Thanks again for your interest, and I look forward to hearing from you!": "Eu posto atualizações regulares e interajo com meus seguidores lá, então não hesite em entrar em contato. Obrigado novamente pelo seu interesse e aguardo seu contato!",
        "Read Article": "Ler Artigo",
        "Read article": "Ler artigo",
        "14 Habits of Highly Productive Programmers": "14 Hábitos de programadores altamente produtivos",
        "Here are 14 habits of highly productive programmers that you can use to improve your own productivity.": "Aqui estão 14 hábitos de programadores altamente produtivos que você pode usar para melhorar sua própria produtividade.",
        "18 Feb 2023": "18 Fev 2023",
        "Habits of highly productive programmers": "Hábitos de programadores altamente produtivos",
        "Productivity Techniques": "Técnicas de produtividade",
        "Software Development": "Desenvolvimento de software",
        "Music": "Música",
        "I love music, I listen to it all the time. I like to play the guitar and I also like to DJ.": "Eu amo música, eu escuto o tempo todo. Gosto de tocar violão e também gosto de brincar de ser DJ.",
        "Beach": "Praia",
        "I like to go to the beach, it is a great place to relax and enjoy nature.": "Gosto de ir à praia, é um ótimo lugar para relaxar e curtir a natureza.",
        "Cycling": "Ciclismo",
        "I like to ride a bike, it is a great way to exercise and enjoy nature.": "Gosto de andar de bicicleta, é uma ótima maneira de se exercitar e curtir a natureza.",
        "Games": "Jogos",
        "I like to play games, especially races, FPS and soccer.": "Gosto de jogar, principalmente jogos de corrida, FPS e futebol.",
        "7 May 2023": "7 Mai 2023",
        "Why not return Base64 in an HTTP request response and how to properly implement image rendering from a specific route using StreamableFile from NestJS.": "Por que não retornar Base64 em uma resposta de solicitação HTTP e como implementar corretamente a renderização de imagens a partir de uma rota específica usando StreamableFile do NestJS.",
        "Here I explain why it is not a good idea to return Base64 in an HTTP request response and how to properly implement image rendering from a specific route using StreamableFile from NestJS.": "Aqui eu explico por que não é uma boa ideia retornar Base64 em uma resposta de solicitação HTTP e como implementar corretamente a renderização de imagens a partir de uma rota específica usando StreamableFile do NestJS.",
        "Free deployment of any specific API or WebService on the Render platform using only a Dockerfile.": "Implantação gratuita de qualquer API ou WebService específico na plataforma Render usando apenas um Dockerfile.",
        "Here I explain how to deploy any API or WebService on the Render platform using only a Dockerfile.": "Explicação de como implantar qualquer API ou WebService na plataforma Render usando apenas um Dockerfile.",
        "[Pitch | Open Source] ▶Tik Tech: Automatically Generating Programming Videos with AI.": "[Pitch | Open source] ▶Tik Tech: Gerando videos de programação automaticamente com IA.",
        "In this article, I showcase the Tik Tech app and make a call for contributions.": "Neste artigo, eu mostro o aplicativo Tik Tech e faço um chamado para contribuições.",
        "Artificial Intelligence": "Inteligência Artificial",
        "Automatic Video Generation": "Geração Automática de Vídeos",
        "Contribution": "Contribuição",
        "Open Source": "Código Aberto",
        "Programming": "Programação",
        "Deployment": "Implantação",
        "Free": "Grátis",
        "The so-called 'productivity' will lead us to Burnout.": "A tal 'produtividade' vai nos causar Burnout.",
        "My perspective on how productivity is sold, and the importance of self-awareness.": "Minha perspectiva sobre como a produtividade é vendida, e a importância do autoconhecimento",
        "Productivity": "Produtividade",
        "Self-awareness": "Autoconhecimento",
        "Developer": "Desenvolvedor"
    }
}